hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_hpdma.h
// MISR Configuration

#define	HPDMA_MISR_MIS15						(0x1u<<15)
#define	HPDMA_MISR_MIS14						(0x1u<<14)
#define	HPDMA_MISR_MIS13						(0x1u<<13)
#define	HPDMA_MISR_MIS12						(0x1u<<12)
#define	HPDMA_MISR_MIS11						(0x1u<<11)
#define	HPDMA_MISR_MIS10						(0x1u<<10)
#define	HPDMA_MISR_MIS9							(0x1u<<9)
#define	HPDMA_MISR_MIS8							(0x1u<<8)
#define	HPDMA_MISR_MIS7							(0x1u<<7)
#define	HPDMA_MISR_MIS6							(0x1u<<6)
#define	HPDMA_MISR_MIS5							(0x1u<<5)
#define	HPDMA_MISR_MIS4							(0x1u<<4)
#define	HPDMA_MISR_MIS3							(0x1u<<3)
#define	HPDMA_MISR_MIS2							(0x1u<<2)
#define	HPDMA_MISR_MIS1							(0x1u<<1)
#define	HPDMA_MISR_MIS0							(0x1u<<0)

#define	HPDMA_MISR_MIS15_B_0X0					(0x0u<<15)
#define	HPDMA_MISR_MIS15_B_0X1					(0x1u<<15)
#define	HPDMA_MISR_MIS14_B_0X0					(0x0u<<14)
#define	HPDMA_MISR_MIS14_B_0X1					(0x1u<<14)
#define	HPDMA_MISR_MIS13_B_0X0					(0x0u<<13)
#define	HPDMA_MISR_MIS13_B_0X1					(0x1u<<13)
#define	HPDMA_MISR_MIS12_B_0X0					(0x0u<<12)
#define	HPDMA_MISR_MIS12_B_0X1					(0x1u<<12)
#define	HPDMA_MISR_MIS11_B_0X0					(0x0u<<11)
#define	HPDMA_MISR_MIS11_B_0X1					(0x1u<<11)
#define	HPDMA_MISR_MIS10_B_0X0					(0x0u<<10)
#define	HPDMA_MISR_MIS10_B_0X1					(0x1u<<10)
#define	HPDMA_MISR_MIS9_B_0X0					(0x0u<<9)
#define	HPDMA_MISR_MIS9_B_0X1					(0x1u<<9)
#define	HPDMA_MISR_MIS8_B_0X0					(0x0u<<8)
#define	HPDMA_MISR_MIS8_B_0X1					(0x1u<<8)
#define	HPDMA_MISR_MIS7_B_0X0					(0x0u<<7)
#define	HPDMA_MISR_MIS7_B_0X1					(0x1u<<7)
#define	HPDMA_MISR_MIS6_B_0X0					(0x0u<<6)
#define	HPDMA_MISR_MIS6_B_0X1					(0x1u<<6)
#define	HPDMA_MISR_MIS5_B_0X0					(0x0u<<5)
#define	HPDMA_MISR_MIS5_B_0X1					(0x1u<<5)
#define	HPDMA_MISR_MIS4_B_0X0					(0x0u<<4)
#define	HPDMA_MISR_MIS4_B_0X1					(0x1u<<4)
#define	HPDMA_MISR_MIS3_B_0X0					(0x0u<<3)
#define	HPDMA_MISR_MIS3_B_0X1					(0x1u<<3)
#define	HPDMA_MISR_MIS2_B_0X0					(0x0u<<2)
#define	HPDMA_MISR_MIS2_B_0X1					(0x1u<<2)
#define	HPDMA_MISR_MIS1_B_0X0					(0x0u<<1)
#define	HPDMA_MISR_MIS1_B_0X1					(0x1u<<1)
#define	HPDMA_MISR_MIS0_B_0X0					(0x0u<<0)
#define	HPDMA_MISR_MIS0_B_0X1					(0x1u<<0)

// SMISR Configuration

#define	HPDMA_SMISR_MIS15						(0x1u<<15)
#define	HPDMA_SMISR_MIS14						(0x1u<<14)
#define	HPDMA_SMISR_MIS13						(0x1u<<13)
#define	HPDMA_SMISR_MIS12						(0x1u<<12)
#define	HPDMA_SMISR_MIS11						(0x1u<<11)
#define	HPDMA_SMISR_MIS10						(0x1u<<10)
#define	HPDMA_SMISR_MIS9						(0x1u<<9)
#define	HPDMA_SMISR_MIS8						(0x1u<<8)
#define	HPDMA_SMISR_MIS7						(0x1u<<7)
#define	HPDMA_SMISR_MIS6						(0x1u<<6)
#define	HPDMA_SMISR_MIS5						(0x1u<<5)
#define	HPDMA_SMISR_MIS4						(0x1u<<4)
#define	HPDMA_SMISR_MIS3						(0x1u<<3)
#define	HPDMA_SMISR_MIS2						(0x1u<<2)
#define	HPDMA_SMISR_MIS1						(0x1u<<1)
#define	HPDMA_SMISR_MIS0						(0x1u<<0)

#define	HPDMA_SMISR_MIS15_B_0X0					(0x0u<<15)
#define	HPDMA_SMISR_MIS15_B_0X1					(0x1u<<15)
#define	HPDMA_SMISR_MIS14_B_0X0					(0x0u<<14)
#define	HPDMA_SMISR_MIS14_B_0X1					(0x1u<<14)
#define	HPDMA_SMISR_MIS13_B_0X0					(0x0u<<13)
#define	HPDMA_SMISR_MIS13_B_0X1					(0x1u<<13)
#define	HPDMA_SMISR_MIS12_B_0X0					(0x0u<<12)
#define	HPDMA_SMISR_MIS12_B_0X1					(0x1u<<12)
#define	HPDMA_SMISR_MIS11_B_0X0					(0x0u<<11)
#define	HPDMA_SMISR_MIS11_B_0X1					(0x1u<<11)
#define	HPDMA_SMISR_MIS10_B_0X0					(0x0u<<10)
#define	HPDMA_SMISR_MIS10_B_0X1					(0x1u<<10)
#define	HPDMA_SMISR_MIS9_B_0X0					(0x0u<<9)
#define	HPDMA_SMISR_MIS9_B_0X1					(0x1u<<9)
#define	HPDMA_SMISR_MIS8_B_0X0					(0x0u<<8)
#define	HPDMA_SMISR_MIS8_B_0X1					(0x1u<<8)
#define	HPDMA_SMISR_MIS7_B_0X0					(0x0u<<7)
#define	HPDMA_SMISR_MIS7_B_0X1					(0x1u<<7)
#define	HPDMA_SMISR_MIS6_B_0X0					(0x0u<<6)
#define	HPDMA_SMISR_MIS6_B_0X1					(0x1u<<6)
#define	HPDMA_SMISR_MIS5_B_0X0					(0x0u<<5)
#define	HPDMA_SMISR_MIS5_B_0X1					(0x1u<<5)
#define	HPDMA_SMISR_MIS4_B_0X0					(0x0u<<4)
#define	HPDMA_SMISR_MIS4_B_0X1					(0x1u<<4)
#define	HPDMA_SMISR_MIS3_B_0X0					(0x0u<<3)
#define	HPDMA_SMISR_MIS3_B_0X1					(0x1u<<3)
#define	HPDMA_SMISR_MIS2_B_0X0					(0x0u<<2)
#define	HPDMA_SMISR_MIS2_B_0X1					(0x1u<<2)
#define	HPDMA_SMISR_MIS1_B_0X0					(0x0u<<1)
#define	HPDMA_SMISR_MIS1_B_0X1					(0x1u<<1)
#define	HPDMA_SMISR_MIS0_B_0X0					(0x0u<<0)
#define	HPDMA_SMISR_MIS0_B_0X1					(0x1u<<0)

// C0LBAR Configuration

#define	HPDMA_C0LBAR_LBA						(0xFFFFu<<16)
#define	HPDMA_C0LBAR_LBA_0						(0x1u<<16)

// C0CIDCFGR Configuration

#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID6			(0x1u<<22)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID5			(0x1u<<21)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID4			(0x1u<<20)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID3			(0x1u<<19)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID2			(0x1u<<18)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID1			(0x1u<<17)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID0			(0x1u<<16)
#define	HPDMA_C0CIDCFGR_SCID					(0x7u<<4)
#define	HPDMA_C0CIDCFGR_SCID_0					(0x1u<<4)
#define	HPDMA_C0CIDCFGR_SEM_EN					(0x1u<<1)
#define	HPDMA_C0CIDCFGR_CFEN					(0x1u<<0)

#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID6_B_0X0	(0x0u<<22)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID6_B_0X1	(0x1u<<22)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID5_B_0X0	(0x0u<<21)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID5_B_0X1	(0x1u<<21)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID4_B_0X0	(0x0u<<20)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID4_B_0X1	(0x1u<<20)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID3_B_0X0	(0x0u<<19)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID3_B_0X1	(0x1u<<19)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID2_B_0X0	(0x0u<<18)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID2_B_0X1	(0x1u<<18)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID1_B_0X0	(0x0u<<17)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID1_B_0X1	(0x1u<<17)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID0_B_0X0	(0x0u<<16)
#define	HPDMA_C0CIDCFGR_SEM_WLIST_CID0_B_0X1	(0x1u<<16)
#define	HPDMA_C0CIDCFGR_SCID_B_0X0				(0x0u<<4)
#define	HPDMA_C0CIDCFGR_SCID_B_0X1				(0x1u<<4)
#define	HPDMA_C0CIDCFGR_SCID_B_0X2				(0x2u<<4)
#define	HPDMA_C0CIDCFGR_SCID_B_0X3				(0x3u<<4)
#define	HPDMA_C0CIDCFGR_SCID_B_0X4				(0x4u<<4)
#define	HPDMA_C0CIDCFGR_SCID_B_0X5				(0x5u<<4)
#define	HPDMA_C0CIDCFGR_SCID_B_0X6				(0x6u<<4)
#define	HPDMA_C0CIDCFGR_SEM_EN_B_0X0			(0x0u<<1)
#define	HPDMA_C0CIDCFGR_SEM_EN_B_0X1			(0x1u<<1)
#define	HPDMA_C0CIDCFGR_CFEN_B_0X0				(0x0u<<0)
#define	HPDMA_C0CIDCFGR_CFEN_B_0X1				(0x1u<<0)

// C0SEMCR Configuration

#define	HPDMA_C0SEMCR_SEM_CCID					(0x7u<<4)
#define	HPDMA_C0SEMCR_SEM_CCID_0				(0x1u<<4)
#define	HPDMA_C0SEMCR_SEM_MUTEX					(0x1u<<0)

#define	HPDMA_C0SEMCR_SEM_CCID_B_0X0			(0x0u<<4)
#define	HPDMA_C0SEMCR_SEM_CCID_B_0X1			(0x1u<<4)
#define	HPDMA_C0SEMCR_SEM_CCID_B_0X2			(0x2u<<4)
#define	HPDMA_C0SEMCR_SEM_CCID_B_0X3			(0x3u<<4)
#define	HPDMA_C0SEMCR_SEM_CCID_B_0X4			(0x4u<<4)
#define	HPDMA_C0SEMCR_SEM_CCID_B_0X5			(0x5u<<4)
#define	HPDMA_C0SEMCR_SEM_CCID_B_0X6			(0x6u<<4)
#define	HPDMA_C0SEMCR_SEM_MUTEX_B_0X0_WRITE		(0x0u<<0)
#define	HPDMA_C0SEMCR_SEM_MUTEX_B_0X1_WRITE		(0x1u<<0)

