hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_hpdma.h
#define	HPDMA_C0TR2_TCEM_B_0X0					(0x0u<<30)
#define	HPDMA_C0TR2_TCEM_B_0X1					(0x1u<<30)
#define	HPDMA_C0TR2_TCEM_B_0X2					(0x2u<<30)
#define	HPDMA_C0TR2_TCEM_B_0X3					(0x3u<<30)
#define	HPDMA_C0TR2_TRIGPOL_B_0X0				(0x0u<<24)
#define	HPDMA_C0TR2_TRIGPOL_B_0X1				(0x1u<<24)
#define	HPDMA_C0TR2_TRIGPOL_B_0X2				(0x2u<<24)
#define	HPDMA_C0TR2_TRIGPOL_B_0X3				(0x3u<<24)
#define	HPDMA_C0TR2_TRIGM_B_0X0					(0x0u<<14)
#define	HPDMA_C0TR2_TRIGM_B_0X1					(0x1u<<14)
#define	HPDMA_C0TR2_TRIGM_B_0X2					(0x2u<<14)
#define	HPDMA_C0TR2_TRIGM_B_0X3					(0x3u<<14)
#define	HPDMA_C0TR2_PFREQ_B_0X0					(0x0u<<12)
#define	HPDMA_C0TR2_PFREQ_B_0X1					(0x1u<<12)
#define	HPDMA_C0TR2_BREQ_B_0X0					(0x0u<<11)
#define	HPDMA_C0TR2_BREQ_B_0X1					(0x1u<<11)
#define	HPDMA_C0TR2_DREQ_B_0X0					(0x0u<<10)
#define	HPDMA_C0TR2_DREQ_B_0X1					(0x1u<<10)
#define	HPDMA_C0TR2_SWREQ_B_0X0					(0x0u<<9)
#define	HPDMA_C0TR2_SWREQ_B_0X1					(0x1u<<9)

// C0BR1 Configuration

#define	HPDMA_C0BR1_BNDT						(0xFFFFu<<0)
#define	HPDMA_C0BR1_BNDT_0						(0x1u<<0)

// C0SAR Configuration

#define	HPDMA_C0SAR_SA							(0xFFFFFFFFu<<0)
#define	HPDMA_C0SAR_SA_0						(0x1u<<0)

// C0DAR Configuration

#define	HPDMA_C0DAR_DA							(0xFFFFFFFFu<<0)
#define	HPDMA_C0DAR_DA_0						(0x1u<<0)

// C0LLR Configuration

#define	HPDMA_C0LLR_UT1							(0x1u<<31)
#define	HPDMA_C0LLR_UT2							(0x1u<<30)
#define	HPDMA_C0LLR_UB1							(0x1u<<29)
#define	HPDMA_C0LLR_USA							(0x1u<<28)
#define	HPDMA_C0LLR_UDA							(0x1u<<27)
#define	HPDMA_C0LLR_ULL							(0x1u<<16)
#define	HPDMA_C0LLR_LA							(0x3FFFu<<2)
#define	HPDMA_C0LLR_LA_0						(0x1u<<2)

#define	HPDMA_C0LLR_UT1_B_0X0					(0x0u<<31)
#define	HPDMA_C0LLR_UT1_B_0X1					(0x1u<<31)
#define	HPDMA_C0LLR_UT2_B_0X0					(0x0u<<30)
#define	HPDMA_C0LLR_UT2_B_0X1					(0x1u<<30)
#define	HPDMA_C0LLR_UB1_B_0X0					(0x0u<<29)
#define	HPDMA_C0LLR_UB1_B_0X1					(0x1u<<29)
#define	HPDMA_C0LLR_USA_B_0X0					(0x0u<<28)
#define	HPDMA_C0LLR_USA_B_0X1					(0x1u<<28)
#define	HPDMA_C0LLR_UDA_B_0X0					(0x0u<<27)
#define	HPDMA_C0LLR_UDA_B_0X1					(0x1u<<27)
#define	HPDMA_C0LLR_ULL_B_0X0					(0x0u<<16)
#define	HPDMA_C0LLR_ULL_B_0X1					(0x1u<<16)

// C1LBAR Configuration

#define	HPDMA_C1LBAR_LBA						(0xFFFFu<<16)
#define	HPDMA_C1LBAR_LBA_0						(0x1u<<16)

// C1CIDCFGR Configuration

#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID6			(0x1u<<22)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID5			(0x1u<<21)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID4			(0x1u<<20)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID3			(0x1u<<19)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID2			(0x1u<<18)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID1			(0x1u<<17)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID0			(0x1u<<16)
#define	HPDMA_C1CIDCFGR_SCID					(0x7u<<4)
#define	HPDMA_C1CIDCFGR_SCID_0					(0x1u<<4)
#define	HPDMA_C1CIDCFGR_SEM_EN					(0x1u<<1)
#define	HPDMA_C1CIDCFGR_CFEN					(0x1u<<0)

#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID6_B_0X0	(0x0u<<22)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID6_B_0X1	(0x1u<<22)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID5_B_0X0	(0x0u<<21)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID5_B_0X1	(0x1u<<21)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID4_B_0X0	(0x0u<<20)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID4_B_0X1	(0x1u<<20)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID3_B_0X0	(0x0u<<19)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID3_B_0X1	(0x1u<<19)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID2_B_0X0	(0x0u<<18)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID2_B_0X1	(0x1u<<18)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID1_B_0X0	(0x0u<<17)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID1_B_0X1	(0x1u<<17)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID0_B_0X0	(0x0u<<16)
#define	HPDMA_C1CIDCFGR_SEM_WLIST_CID0_B_0X1	(0x1u<<16)
#define	HPDMA_C1CIDCFGR_SCID_B_0X0				(0x0u<<4)
#define	HPDMA_C1CIDCFGR_SCID_B_0X1				(0x1u<<4)
#define	HPDMA_C1CIDCFGR_SCID_B_0X2				(0x2u<<4)
#define	HPDMA_C1CIDCFGR_SCID_B_0X3				(0x3u<<4)
#define	HPDMA_C1CIDCFGR_SCID_B_0X4				(0x4u<<4)
#define	HPDMA_C1CIDCFGR_SCID_B_0X5				(0x5u<<4)
#define	HPDMA_C1CIDCFGR_SCID_B_0X6				(0x6u<<4)
#define	HPDMA_C1CIDCFGR_SEM_EN_B_0X0			(0x0u<<1)
#define	HPDMA_C1CIDCFGR_SEM_EN_B_0X1			(0x1u<<1)
#define	HPDMA_C1CIDCFGR_CFEN_B_0X0				(0x0u<<0)
#define	HPDMA_C1CIDCFGR_CFEN_B_0X1				(0x1u<<0)

// C1SEMCR Configuration

#define	HPDMA_C1SEMCR_SEM_CCID					(0x7u<<4)
#define	HPDMA_C1SEMCR_SEM_CCID_0				(0x1u<<4)
#define	HPDMA_C1SEMCR_SEM_MUTEX					(0x1u<<0)

#define	HPDMA_C1SEMCR_SEM_CCID_B_0X0			(0x0u<<4)
#define	HPDMA_C1SEMCR_SEM_CCID_B_0X1			(0x1u<<4)
#define	HPDMA_C1SEMCR_SEM_CCID_B_0X2			(0x2u<<4)
#define	HPDMA_C1SEMCR_SEM_CCID_B_0X3			(0x3u<<4)
#define	HPDMA_C1SEMCR_SEM_CCID_B_0X4			(0x4u<<4)
#define	HPDMA_C1SEMCR_SEM_CCID_B_0X5			(0x5u<<4)
#define	HPDMA_C1SEMCR_SEM_CCID_B_0X6			(0x6u<<4)
#define	HPDMA_C1SEMCR_SEM_MUTEX_B_0X0_WRITE		(0x0u<<0)
#define	HPDMA_C1SEMCR_SEM_MUTEX_B_0X1_WRITE		(0x1u<<0)

// C1FCR Configuration

#define	HPDMA_C1FCR_TOF							(0x1u<<14)
#define	HPDMA_C1FCR_SUSPF						(0x1u<<13)
#define	HPDMA_C1FCR_USEF						(0x1u<<12)
#define	HPDMA_C1FCR_ULEF						(0x1u<<11)
#define	HPDMA_C1FCR_DTEF						(0x1u<<10)
#define	HPDMA_C1FCR_HTF							(0x1u<<9)
#define	HPDMA_C1FCR_TCF							(0x1u<<8)

#define	HPDMA_C1FCR_TOF_B_0X0					(0x0u<<14)
#define	HPDMA_C1FCR_TOF_B_0X1					(0x1u<<14)
#define	HPDMA_C1FCR_SUSPF_B_0X0					(0x0u<<13)
#define	HPDMA_C1FCR_SUSPF_B_0X1					(0x1u<<13)
#define	HPDMA_C1FCR_USEF_B_0X0					(0x0u<<12)
#define	HPDMA_C1FCR_USEF_B_0X1					(0x1u<<12)
#define	HPDMA_C1FCR_ULEF_B_0X0					(0x0u<<11)
#define	HPDMA_C1FCR_ULEF_B_0X1					(0x1u<<11)
#define	HPDMA_C1FCR_DTEF_B_0X0					(0x0u<<10)
#define	HPDMA_C1FCR_DTEF_B_0X1					(0x1u<<10)
#define	HPDMA_C1FCR_HTF_B_0X0					(0x0u<<9)
#define	HPDMA_C1FCR_HTF_B_0X1					(0x1u<<9)
#define	HPDMA_C1FCR_TCF_B_0X0					(0x0u<<8)
#define	HPDMA_C1FCR_TCF_B_0X1					(0x1u<<8)

// C1SR Configuration

#define	HPDMA_C1SR_FIFOL						(0x1FFu<<16)
#define	HPDMA_C1SR_FIFOL_0						(0x1u<<16)
#define	HPDMA_C1SR_TOF							(0x1u<<14)
#define	HPDMA_C1SR_SUSPF						(0x1u<<13)
#define	HPDMA_C1SR_USEF							(0x1u<<12)
#define	HPDMA_C1SR_ULEF							(0x1u<<11)
#define	HPDMA_C1SR_DTEF							(0x1u<<10)
#define	HPDMA_C1SR_HTF							(0x1u<<9)
#define	HPDMA_C1SR_TCF							(0x1u<<8)
#define	HPDMA_C1SR_IDLEF						(0x1u<<0)

#define	HPDMA_C1SR_TOF_B_0X0					(0x0u<<14)
#define	HPDMA_C1SR_TOF_B_0X1					(0x1u<<14)
#define	HPDMA_C1SR_SUSPF_B_0X0					(0x0u<<13)
#define	HPDMA_C1SR_SUSPF_B_0X1					(0x1u<<13)
#define	HPDMA_C1SR_USEF_B_0X0					(0x0u<<12)
#define	HPDMA_C1SR_USEF_B_0X1					(0x1u<<12)
#define	HPDMA_C1SR_ULEF_B_0X0					(0x0u<<11)
#define	HPDMA_C1SR_ULEF_B_0X1					(0x1u<<11)
#define	HPDMA_C1SR_DTEF_B_0X0					(0x0u<<10)
#define	HPDMA_C1SR_DTEF_B_0X1					(0x1u<<10)
#define	HPDMA_C1SR_HTF_B_0X0					(0x0u<<9)
#define	HPDMA_C1SR_HTF_B_0X1					(0x1u<<9)
#define	HPDMA_C1SR_TCF_B_0X0					(0x0u<<8)
#define	HPDMA_C1SR_TCF_B_0X1					(0x1u<<8)
#define	HPDMA_C1SR_IDLEF_B_0X0					(0x0u<<0)
#define	HPDMA_C1SR_IDLEF_B_0X1					(0x1u<<0)

// C1CR Configuration

#define	HPDMA_C1CR_PRIO							(0x3u<<22)
#define	HPDMA_C1CR_PRIO_0						(0x1u<<22)
#define	HPDMA_C1CR_LAP							(0x1u<<17)
#define	HPDMA_C1CR_LSM							(0x1u<<16)
#define	HPDMA_C1CR_TOIE							(0x1u<<14)
#define	HPDMA_C1CR_SUSPIE						(0x1u<<13)
#define	HPDMA_C1CR_USEIE						(0x1u<<12)
#define	HPDMA_C1CR_ULEIE						(0x1u<<11)
#define	HPDMA_C1CR_DTEIE						(0x1u<<10)
#define	HPDMA_C1CR_HTIE							(0x1u<<9)
#define	HPDMA_C1CR_TCIE							(0x1u<<8)
#define	HPDMA_C1CR_SUSP							(0x1u<<2)
#define	HPDMA_C1CR_RESET						(0x1u<<1)
#define	HPDMA_C1CR_EN							(0x1u<<0)

#define	HPDMA_C1CR_PRIO_B_0X0					(0x0u<<22)
#define	HPDMA_C1CR_PRIO_B_0X1					(0x1u<<22)
#define	HPDMA_C1CR_PRIO_B_0X2					(0x2u<<22)
#define	HPDMA_C1CR_PRIO_B_0X3					(0x3u<<22)
#define	HPDMA_C1CR_LAP_B_0X0					(0x0u<<17)
#define	HPDMA_C1CR_LAP_B_0X1					(0x1u<<17)
#define	HPDMA_C1CR_LSM_B_0X0					(0x0u<<16)
#define	HPDMA_C1CR_LSM_B_0X1					(0x1u<<16)
#define	HPDMA_C1CR_TOIE_B_0X0					(0x0u<<14)
#define	HPDMA_C1CR_TOIE_B_0X1					(0x1u<<14)
#define	HPDMA_C1CR_SUSPIE_B_0X0					(0x0u<<13)
#define	HPDMA_C1CR_SUSPIE_B_0X1					(0x1u<<13)
#define	HPDMA_C1CR_USEIE_B_0X0					(0x0u<<12)
#define	HPDMA_C1CR_USEIE_B_0X1					(0x1u<<12)
#define	HPDMA_C1CR_ULEIE_B_0X0					(0x0u<<11)
#define	HPDMA_C1CR_ULEIE_B_0X1					(0x1u<<11)
#define	HPDMA_C1CR_DTEIE_B_0X0					(0x0u<<10)
#define	HPDMA_C1CR_DTEIE_B_0X1					(0x1u<<10)
#define	HPDMA_C1CR_HTIE_B_0X0					(0x0u<<9)
#define	HPDMA_C1CR_HTIE_B_0X1					(0x1u<<9)
#define	HPDMA_C1CR_TCIE_B_0X0					(0x0u<<8)
#define	HPDMA_C1CR_TCIE_B_0X1					(0x1u<<8)
#define	HPDMA_C1CR_SUSP_B_0X0					(0x0u<<2)
#define	HPDMA_C1CR_SUSP_B_0X1					(0x1u<<2)
#define	HPDMA_C1CR_RESET_B_0X0					(0x0u<<1)
#define	HPDMA_C1CR_RESET_B_0X1					(0x1u<<1)
#define	HPDMA_C1CR_EN_B_0X0						(0x0u<<0)
#define	HPDMA_C1CR_EN_B_0X1						(0x1u<<0)

// C1TR1 Configuration

#define	HPDMA_C1TR1_DSEC						(0x1u<<31)
#define	HPDMA_C1TR1_DAP							(0x1u<<30)
#define	HPDMA_C1TR1_DWX							(0x1u<<28)
#define	HPDMA_C1TR1_DHX							(0x1u<<27)
#define	HPDMA_C1TR1_DBX							(0x1u<<26)
#define	HPDMA_C1TR1_DBL_1						(0x3Fu<<20)
#define	HPDMA_C1TR1_DBL_1_0						(0x1u<<20)
#define	HPDMA_C1TR1_DINC						(0x1u<<19)
#define	HPDMA_C1TR1_DDW_LOG2					(0x3u<<16)
#define	HPDMA_C1TR1_DDW_LOG2_0					(0x1u<<16)
#define	HPDMA_C1TR1_SSEC						(0x1u<<15)
#define	HPDMA_C1TR1_SAP							(0x1u<<14)
#define	HPDMA_C1TR1_SBX							(0x1u<<13)
#define	HPDMA_C1TR1_PAM							(0x3u<<11)
#define	HPDMA_C1TR1_PAM_0						(0x1u<<11)
#define	HPDMA_C1TR1_SBL_1						(0x3Fu<<4)
#define	HPDMA_C1TR1_SBL_1_0						(0x1u<<4)
#define	HPDMA_C1TR1_SINC						(0x1u<<3)
#define	HPDMA_C1TR1_SDW_LOG2					(0x3u<<0)
#define	HPDMA_C1TR1_SDW_LOG2_0					(0x1u<<0)

#define	HPDMA_C1TR1_DSEC_B_0X0					(0x0u<<31)
#define	HPDMA_C1TR1_DSEC_B_0X1					(0x1u<<31)
#define	HPDMA_C1TR1_DAP_B_0X0					(0x0u<<30)
#define	HPDMA_C1TR1_DAP_B_0X1					(0x1u<<30)
#define	HPDMA_C1TR1_DWX_B_0X0					(0x0u<<28)
#define	HPDMA_C1TR1_DWX_B_0X1					(0x1u<<28)
#define	HPDMA_C1TR1_DHX_B_0X0					(0x0u<<27)
#define	HPDMA_C1TR1_DHX_B_0X1					(0x1u<<27)
#define	HPDMA_C1TR1_DBX_B_0X0					(0x0u<<26)
#define	HPDMA_C1TR1_DBX_B_0X1					(0x1u<<26)
#define	HPDMA_C1TR1_DINC_B_0X0					(0x0u<<19)
#define	HPDMA_C1TR1_DINC_B_0X1					(0x1u<<19)
#define	HPDMA_C1TR1_DDW_LOG2_B_0X0				(0x0u<<16)
#define	HPDMA_C1TR1_DDW_LOG2_B_0X1				(0x1u<<16)
#define	HPDMA_C1TR1_DDW_LOG2_B_0X2				(0x2u<<16)
#define	HPDMA_C1TR1_DDW_LOG2_B_0X3				(0x3u<<16)
#define	HPDMA_C1TR1_SSEC_B_0X0					(0x0u<<15)
#define	HPDMA_C1TR1_SSEC_B_0X1					(0x1u<<15)
#define	HPDMA_C1TR1_SAP_B_0X0					(0x0u<<14)
#define	HPDMA_C1TR1_SAP_B_0X1					(0x1u<<14)
#define	HPDMA_C1TR1_SBX_B_0X0					(0x0u<<13)
#define	HPDMA_C1TR1_SBX_B_0X1					(0x1u<<13)
#define	HPDMA_C1TR1_PAM_B_0X0_PAM_1				(0x0u<<11)
#define	HPDMA_C1TR1_PAM_B_0X1_PAM_1				(0x1u<<11)
#define	HPDMA_C1TR1_PAM_B_0X2_PAM_1				(0x2u<<11)
#define	HPDMA_C1TR1_PAM_B_0X3_PAM_1				(0x3u<<11)
#define	HPDMA_C1TR1_SINC_B_0X0					(0x0u<<3)
#define	HPDMA_C1TR1_SINC_B_0X1					(0x1u<<3)
#define	HPDMA_C1TR1_SDW_LOG2_B_0X0				(0x0u<<0)
#define	HPDMA_C1TR1_SDW_LOG2_B_0X1				(0x1u<<0)
#define	HPDMA_C1TR1_SDW_LOG2_B_0X2				(0x2u<<0)
#define	HPDMA_C1TR1_SDW_LOG2_B_0X3				(0x3u<<0)

// C1TR2 Configuration

#define	HPDMA_C1TR2_TCEM						(0x3u<<30)
#define	HPDMA_C1TR2_TCEM_0						(0x1u<<30)
#define	HPDMA_C1TR2_TRIGPOL						(0x3u<<24)
#define	HPDMA_C1TR2_TRIGPOL_0					(0x1u<<24)
#define	HPDMA_C1TR2_TRIGSEL						(0x7Fu<<16)
#define	HPDMA_C1TR2_TRIGSEL_0					(0x1u<<16)
#define	HPDMA_C1TR2_TRIGM						(0x3u<<14)
#define	HPDMA_C1TR2_TRIGM_0						(0x1u<<14)
#define	HPDMA_C1TR2_PFREQ						(0x1u<<12)
#define	HPDMA_C1TR2_BREQ						(0x1u<<11)
#define	HPDMA_C1TR2_DREQ						(0x1u<<10)
#define	HPDMA_C1TR2_SWREQ						(0x1u<<9)
#define	HPDMA_C1TR2_REQSEL						(0xFFu<<0)
#define	HPDMA_C1TR2_REQSEL_0					(0x1u<<0)

