hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_hpdma.h
#define	HPDMA_C1TR2_TCEM_B_0X0					(0x0u<<30)
#define	HPDMA_C1TR2_TCEM_B_0X1					(0x1u<<30)
#define	HPDMA_C1TR2_TCEM_B_0X2					(0x2u<<30)
#define	HPDMA_C1TR2_TCEM_B_0X3					(0x3u<<30)
#define	HPDMA_C1TR2_TRIGPOL_B_0X0				(0x0u<<24)
#define	HPDMA_C1TR2_TRIGPOL_B_0X1				(0x1u<<24)
#define	HPDMA_C1TR2_TRIGPOL_B_0X2				(0x2u<<24)
#define	HPDMA_C1TR2_TRIGPOL_B_0X3				(0x3u<<24)
#define	HPDMA_C1TR2_TRIGM_B_0X0					(0x0u<<14)
#define	HPDMA_C1TR2_TRIGM_B_0X1					(0x1u<<14)
#define	HPDMA_C1TR2_TRIGM_B_0X2					(0x2u<<14)
#define	HPDMA_C1TR2_TRIGM_B_0X3					(0x3u<<14)
#define	HPDMA_C1TR2_PFREQ_B_0X0					(0x0u<<12)
#define	HPDMA_C1TR2_PFREQ_B_0X1					(0x1u<<12)
#define	HPDMA_C1TR2_BREQ_B_0X0					(0x0u<<11)
#define	HPDMA_C1TR2_BREQ_B_0X1					(0x1u<<11)
#define	HPDMA_C1TR2_DREQ_B_0X0					(0x0u<<10)
#define	HPDMA_C1TR2_DREQ_B_0X1					(0x1u<<10)
#define	HPDMA_C1TR2_SWREQ_B_0X0					(0x0u<<9)
#define	HPDMA_C1TR2_SWREQ_B_0X1					(0x1u<<9)

// C1BR1 Configuration

#define	HPDMA_C1BR1_BNDT						(0xFFFFu<<0)
#define	HPDMA_C1BR1_BNDT_0						(0x1u<<0)

// C1SAR Configuration

#define	HPDMA_C1SAR_SA							(0xFFFFFFFFu<<0)
#define	HPDMA_C1SAR_SA_0						(0x1u<<0)

// C1DAR Configuration

#define	HPDMA_C1DAR_DA							(0xFFFFFFFFu<<0)
#define	HPDMA_C1DAR_DA_0						(0x1u<<0)

// C1LLR Configuration

#define	HPDMA_C1LLR_UT1							(0x1u<<31)
#define	HPDMA_C1LLR_UT2							(0x1u<<30)
#define	HPDMA_C1LLR_UB1							(0x1u<<29)
#define	HPDMA_C1LLR_USA							(0x1u<<28)
#define	HPDMA_C1LLR_UDA							(0x1u<<27)
#define	HPDMA_C1LLR_ULL							(0x1u<<16)
#define	HPDMA_C1LLR_LA							(0x3FFFu<<2)
#define	HPDMA_C1LLR_LA_0						(0x1u<<2)

#define	HPDMA_C1LLR_UT1_B_0X0					(0x0u<<31)
#define	HPDMA_C1LLR_UT1_B_0X1					(0x1u<<31)
#define	HPDMA_C1LLR_UT2_B_0X0					(0x0u<<30)
#define	HPDMA_C1LLR_UT2_B_0X1					(0x1u<<30)
#define	HPDMA_C1LLR_UB1_B_0X0					(0x0u<<29)
#define	HPDMA_C1LLR_UB1_B_0X1					(0x1u<<29)
#define	HPDMA_C1LLR_USA_B_0X0					(0x0u<<28)
#define	HPDMA_C1LLR_USA_B_0X1					(0x1u<<28)
#define	HPDMA_C1LLR_UDA_B_0X0					(0x0u<<27)
#define	HPDMA_C1LLR_UDA_B_0X1					(0x1u<<27)
#define	HPDMA_C1LLR_ULL_B_0X0					(0x0u<<16)
#define	HPDMA_C1LLR_ULL_B_0X1					(0x1u<<16)

// C2LBAR Configuration

#define	HPDMA_C2LBAR_LBA						(0xFFFFu<<16)
#define	HPDMA_C2LBAR_LBA_0						(0x1u<<16)

// C2CIDCFGR Configuration

#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID6			(0x1u<<22)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID5			(0x1u<<21)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID4			(0x1u<<20)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID3			(0x1u<<19)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID2			(0x1u<<18)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID1			(0x1u<<17)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID0			(0x1u<<16)
#define	HPDMA_C2CIDCFGR_SCID					(0x7u<<4)
#define	HPDMA_C2CIDCFGR_SCID_0					(0x1u<<4)
#define	HPDMA_C2CIDCFGR_SEM_EN					(0x1u<<1)
#define	HPDMA_C2CIDCFGR_CFEN					(0x1u<<0)

#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID6_B_0X0	(0x0u<<22)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID6_B_0X1	(0x1u<<22)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID5_B_0X0	(0x0u<<21)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID5_B_0X1	(0x1u<<21)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID4_B_0X0	(0x0u<<20)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID4_B_0X1	(0x1u<<20)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID3_B_0X0	(0x0u<<19)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID3_B_0X1	(0x1u<<19)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID2_B_0X0	(0x0u<<18)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID2_B_0X1	(0x1u<<18)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID1_B_0X0	(0x0u<<17)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID1_B_0X1	(0x1u<<17)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID0_B_0X0	(0x0u<<16)
#define	HPDMA_C2CIDCFGR_SEM_WLIST_CID0_B_0X1	(0x1u<<16)
#define	HPDMA_C2CIDCFGR_SCID_B_0X0				(0x0u<<4)
#define	HPDMA_C2CIDCFGR_SCID_B_0X1				(0x1u<<4)
#define	HPDMA_C2CIDCFGR_SCID_B_0X2				(0x2u<<4)
#define	HPDMA_C2CIDCFGR_SCID_B_0X3				(0x3u<<4)
#define	HPDMA_C2CIDCFGR_SCID_B_0X4				(0x4u<<4)
#define	HPDMA_C2CIDCFGR_SCID_B_0X5				(0x5u<<4)
#define	HPDMA_C2CIDCFGR_SCID_B_0X6				(0x6u<<4)
#define	HPDMA_C2CIDCFGR_SEM_EN_B_0X0			(0x0u<<1)
#define	HPDMA_C2CIDCFGR_SEM_EN_B_0X1			(0x1u<<1)
#define	HPDMA_C2CIDCFGR_CFEN_B_0X0				(0x0u<<0)
#define	HPDMA_C2CIDCFGR_CFEN_B_0X1				(0x1u<<0)

// C2SEMCR Configuration

#define	HPDMA_C2SEMCR_SEM_CCID					(0x7u<<4)
#define	HPDMA_C2SEMCR_SEM_CCID_0				(0x1u<<4)
#define	HPDMA_C2SEMCR_SEM_MUTEX					(0x1u<<0)

#define	HPDMA_C2SEMCR_SEM_CCID_B_0X0			(0x0u<<4)
#define	HPDMA_C2SEMCR_SEM_CCID_B_0X1			(0x1u<<4)
#define	HPDMA_C2SEMCR_SEM_CCID_B_0X2			(0x2u<<4)
#define	HPDMA_C2SEMCR_SEM_CCID_B_0X3			(0x3u<<4)
#define	HPDMA_C2SEMCR_SEM_CCID_B_0X4			(0x4u<<4)
#define	HPDMA_C2SEMCR_SEM_CCID_B_0X5			(0x5u<<4)
#define	HPDMA_C2SEMCR_SEM_CCID_B_0X6			(0x6u<<4)
#define	HPDMA_C2SEMCR_SEM_MUTEX_B_0X0_WRITE		(0x0u<<0)
#define	HPDMA_C2SEMCR_SEM_MUTEX_B_0X1_WRITE		(0x1u<<0)

// C2FCR Configuration

#define	HPDMA_C2FCR_TOF							(0x1u<<14)
#define	HPDMA_C2FCR_SUSPF						(0x1u<<13)
#define	HPDMA_C2FCR_USEF						(0x1u<<12)
#define	HPDMA_C2FCR_ULEF						(0x1u<<11)
#define	HPDMA_C2FCR_DTEF						(0x1u<<10)
#define	HPDMA_C2FCR_HTF							(0x1u<<9)
#define	HPDMA_C2FCR_TCF							(0x1u<<8)

#define	HPDMA_C2FCR_TOF_B_0X0					(0x0u<<14)
#define	HPDMA_C2FCR_TOF_B_0X1					(0x1u<<14)
#define	HPDMA_C2FCR_SUSPF_B_0X0					(0x0u<<13)
#define	HPDMA_C2FCR_SUSPF_B_0X1					(0x1u<<13)
#define	HPDMA_C2FCR_USEF_B_0X0					(0x0u<<12)
#define	HPDMA_C2FCR_USEF_B_0X1					(0x1u<<12)
#define	HPDMA_C2FCR_ULEF_B_0X0					(0x0u<<11)
#define	HPDMA_C2FCR_ULEF_B_0X1					(0x1u<<11)
#define	HPDMA_C2FCR_DTEF_B_0X0					(0x0u<<10)
#define	HPDMA_C2FCR_DTEF_B_0X1					(0x1u<<10)
#define	HPDMA_C2FCR_HTF_B_0X0					(0x0u<<9)
#define	HPDMA_C2FCR_HTF_B_0X1					(0x1u<<9)
#define	HPDMA_C2FCR_TCF_B_0X0					(0x0u<<8)
#define	HPDMA_C2FCR_TCF_B_0X1					(0x1u<<8)

// C2SR Configuration

#define	HPDMA_C2SR_FIFOL						(0x1FFu<<16)
#define	HPDMA_C2SR_FIFOL_0						(0x1u<<16)
#define	HPDMA_C2SR_TOF							(0x1u<<14)
#define	HPDMA_C2SR_SUSPF						(0x1u<<13)
#define	HPDMA_C2SR_USEF							(0x1u<<12)
#define	HPDMA_C2SR_ULEF							(0x1u<<11)
#define	HPDMA_C2SR_DTEF							(0x1u<<10)
#define	HPDMA_C2SR_HTF							(0x1u<<9)
#define	HPDMA_C2SR_TCF							(0x1u<<8)
#define	HPDMA_C2SR_IDLEF						(0x1u<<0)

