hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_hpdma.h
// C4BR1 Configuration

#define	HPDMA_C4BR1_BNDT						(0xFFFFu<<0)
#define	HPDMA_C4BR1_BNDT_0						(0x1u<<0)

// C4SAR Configuration

#define	HPDMA_C4SAR_SA							(0xFFFFFFFFu<<0)
#define	HPDMA_C4SAR_SA_0						(0x1u<<0)

// C4DAR Configuration

#define	HPDMA_C4DAR_DA							(0xFFFFFFFFu<<0)
#define	HPDMA_C4DAR_DA_0						(0x1u<<0)

// C4LLR Configuration

#define	HPDMA_C4LLR_UT1							(0x1u<<31)
#define	HPDMA_C4LLR_UT2							(0x1u<<30)
#define	HPDMA_C4LLR_UB1							(0x1u<<29)
#define	HPDMA_C4LLR_USA							(0x1u<<28)
#define	HPDMA_C4LLR_UDA							(0x1u<<27)
#define	HPDMA_C4LLR_ULL							(0x1u<<16)
#define	HPDMA_C4LLR_LA							(0x3FFFu<<2)
#define	HPDMA_C4LLR_LA_0						(0x1u<<2)

#define	HPDMA_C4LLR_UT1_B_0X0					(0x0u<<31)
#define	HPDMA_C4LLR_UT1_B_0X1					(0x1u<<31)
#define	HPDMA_C4LLR_UT2_B_0X0					(0x0u<<30)
#define	HPDMA_C4LLR_UT2_B_0X1					(0x1u<<30)
#define	HPDMA_C4LLR_UB1_B_0X0					(0x0u<<29)
#define	HPDMA_C4LLR_UB1_B_0X1					(0x1u<<29)
#define	HPDMA_C4LLR_USA_B_0X0					(0x0u<<28)
#define	HPDMA_C4LLR_USA_B_0X1					(0x1u<<28)
#define	HPDMA_C4LLR_UDA_B_0X0					(0x0u<<27)
#define	HPDMA_C4LLR_UDA_B_0X1					(0x1u<<27)
#define	HPDMA_C4LLR_ULL_B_0X0					(0x0u<<16)
#define	HPDMA_C4LLR_ULL_B_0X1					(0x1u<<16)

// C5LBAR Configuration

#define	HPDMA_C5LBAR_LBA						(0xFFFFu<<16)
#define	HPDMA_C5LBAR_LBA_0						(0x1u<<16)

// C5CIDCFGR Configuration

#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID6			(0x1u<<22)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID5			(0x1u<<21)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID4			(0x1u<<20)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID3			(0x1u<<19)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID2			(0x1u<<18)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID1			(0x1u<<17)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID0			(0x1u<<16)
#define	HPDMA_C5CIDCFGR_SCID					(0x7u<<4)
#define	HPDMA_C5CIDCFGR_SCID_0					(0x1u<<4)
#define	HPDMA_C5CIDCFGR_SEM_EN					(0x1u<<1)
#define	HPDMA_C5CIDCFGR_CFEN					(0x1u<<0)

#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID6_B_0X0	(0x0u<<22)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID6_B_0X1	(0x1u<<22)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID5_B_0X0	(0x0u<<21)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID5_B_0X1	(0x1u<<21)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID4_B_0X0	(0x0u<<20)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID4_B_0X1	(0x1u<<20)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID3_B_0X0	(0x0u<<19)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID3_B_0X1	(0x1u<<19)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID2_B_0X0	(0x0u<<18)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID2_B_0X1	(0x1u<<18)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID1_B_0X0	(0x0u<<17)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID1_B_0X1	(0x1u<<17)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID0_B_0X0	(0x0u<<16)
#define	HPDMA_C5CIDCFGR_SEM_WLIST_CID0_B_0X1	(0x1u<<16)
#define	HPDMA_C5CIDCFGR_SCID_B_0X0				(0x0u<<4)
#define	HPDMA_C5CIDCFGR_SCID_B_0X1				(0x1u<<4)
#define	HPDMA_C5CIDCFGR_SCID_B_0X2				(0x2u<<4)
#define	HPDMA_C5CIDCFGR_SCID_B_0X3				(0x3u<<4)
#define	HPDMA_C5CIDCFGR_SCID_B_0X4				(0x4u<<4)
#define	HPDMA_C5CIDCFGR_SCID_B_0X5				(0x5u<<4)
#define	HPDMA_C5CIDCFGR_SCID_B_0X6				(0x6u<<4)
#define	HPDMA_C5CIDCFGR_SEM_EN_B_0X0			(0x0u<<1)
#define	HPDMA_C5CIDCFGR_SEM_EN_B_0X1			(0x1u<<1)
#define	HPDMA_C5CIDCFGR_CFEN_B_0X0				(0x0u<<0)
#define	HPDMA_C5CIDCFGR_CFEN_B_0X1				(0x1u<<0)

// C5SEMCR Configuration

#define	HPDMA_C5SEMCR_SEM_CCID					(0x7u<<4)
#define	HPDMA_C5SEMCR_SEM_CCID_0				(0x1u<<4)
#define	HPDMA_C5SEMCR_SEM_MUTEX					(0x1u<<0)

#define	HPDMA_C5SEMCR_SEM_CCID_B_0X0			(0x0u<<4)
#define	HPDMA_C5SEMCR_SEM_CCID_B_0X1			(0x1u<<4)
#define	HPDMA_C5SEMCR_SEM_CCID_B_0X2			(0x2u<<4)
#define	HPDMA_C5SEMCR_SEM_CCID_B_0X3			(0x3u<<4)
#define	HPDMA_C5SEMCR_SEM_CCID_B_0X4			(0x4u<<4)
#define	HPDMA_C5SEMCR_SEM_CCID_B_0X5			(0x5u<<4)
#define	HPDMA_C5SEMCR_SEM_CCID_B_0X6			(0x6u<<4)
#define	HPDMA_C5SEMCR_SEM_MUTEX_B_0X0_WRITE		(0x0u<<0)
#define	HPDMA_C5SEMCR_SEM_MUTEX_B_0X1_WRITE		(0x1u<<0)

// C5FCR Configuration

#define	HPDMA_C5FCR_TOF							(0x1u<<14)
#define	HPDMA_C5FCR_SUSPF						(0x1u<<13)
#define	HPDMA_C5FCR_USEF						(0x1u<<12)
#define	HPDMA_C5FCR_ULEF						(0x1u<<11)
#define	HPDMA_C5FCR_DTEF						(0x1u<<10)
#define	HPDMA_C5FCR_HTF							(0x1u<<9)
#define	HPDMA_C5FCR_TCF							(0x1u<<8)

#define	HPDMA_C5FCR_TOF_B_0X0					(0x0u<<14)
#define	HPDMA_C5FCR_TOF_B_0X1					(0x1u<<14)
#define	HPDMA_C5FCR_SUSPF_B_0X0					(0x0u<<13)
#define	HPDMA_C5FCR_SUSPF_B_0X1					(0x1u<<13)
#define	HPDMA_C5FCR_USEF_B_0X0					(0x0u<<12)
#define	HPDMA_C5FCR_USEF_B_0X1					(0x1u<<12)
#define	HPDMA_C5FCR_ULEF_B_0X0					(0x0u<<11)
#define	HPDMA_C5FCR_ULEF_B_0X1					(0x1u<<11)
#define	HPDMA_C5FCR_DTEF_B_0X0					(0x0u<<10)
#define	HPDMA_C5FCR_DTEF_B_0X1					(0x1u<<10)
#define	HPDMA_C5FCR_HTF_B_0X0					(0x0u<<9)
#define	HPDMA_C5FCR_HTF_B_0X1					(0x1u<<9)
#define	HPDMA_C5FCR_TCF_B_0X0					(0x0u<<8)
#define	HPDMA_C5FCR_TCF_B_0X1					(0x1u<<8)

// C5SR Configuration

#define	HPDMA_C5SR_FIFOL						(0x1FFu<<16)
#define	HPDMA_C5SR_FIFOL_0						(0x1u<<16)
#define	HPDMA_C5SR_TOF							(0x1u<<14)
#define	HPDMA_C5SR_SUSPF						(0x1u<<13)
#define	HPDMA_C5SR_USEF							(0x1u<<12)
#define	HPDMA_C5SR_ULEF							(0x1u<<11)
#define	HPDMA_C5SR_DTEF							(0x1u<<10)
#define	HPDMA_C5SR_HTF							(0x1u<<9)
#define	HPDMA_C5SR_TCF							(0x1u<<8)
#define	HPDMA_C5SR_IDLEF						(0x1u<<0)

#define	HPDMA_C5SR_TOF_B_0X0					(0x0u<<14)
#define	HPDMA_C5SR_TOF_B_0X1					(0x1u<<14)
#define	HPDMA_C5SR_SUSPF_B_0X0					(0x0u<<13)
#define	HPDMA_C5SR_SUSPF_B_0X1					(0x1u<<13)
#define	HPDMA_C5SR_USEF_B_0X0					(0x0u<<12)
#define	HPDMA_C5SR_USEF_B_0X1					(0x1u<<12)
#define	HPDMA_C5SR_ULEF_B_0X0					(0x0u<<11)
#define	HPDMA_C5SR_ULEF_B_0X1					(0x1u<<11)
#define	HPDMA_C5SR_DTEF_B_0X0					(0x0u<<10)
#define	HPDMA_C5SR_DTEF_B_0X1					(0x1u<<10)
#define	HPDMA_C5SR_HTF_B_0X0					(0x0u<<9)
#define	HPDMA_C5SR_HTF_B_0X1					(0x1u<<9)
#define	HPDMA_C5SR_TCF_B_0X0					(0x0u<<8)
#define	HPDMA_C5SR_TCF_B_0X1					(0x1u<<8)
#define	HPDMA_C5SR_IDLEF_B_0X0					(0x0u<<0)
#define	HPDMA_C5SR_IDLEF_B_0X1					(0x1u<<0)

// C5CR Configuration

#define	HPDMA_C5CR_PRIO							(0x3u<<22)
#define	HPDMA_C5CR_PRIO_0						(0x1u<<22)
#define	HPDMA_C5CR_LAP							(0x1u<<17)
#define	HPDMA_C5CR_LSM							(0x1u<<16)
#define	HPDMA_C5CR_TOIE							(0x1u<<14)
#define	HPDMA_C5CR_SUSPIE						(0x1u<<13)
#define	HPDMA_C5CR_USEIE						(0x1u<<12)
#define	HPDMA_C5CR_ULEIE						(0x1u<<11)
#define	HPDMA_C5CR_DTEIE						(0x1u<<10)
#define	HPDMA_C5CR_HTIE							(0x1u<<9)
#define	HPDMA_C5CR_TCIE							(0x1u<<8)
#define	HPDMA_C5CR_SUSP							(0x1u<<2)
#define	HPDMA_C5CR_RESET						(0x1u<<1)
#define	HPDMA_C5CR_EN							(0x1u<<0)

#define	HPDMA_C5CR_PRIO_B_0X0					(0x0u<<22)
#define	HPDMA_C5CR_PRIO_B_0X1					(0x1u<<22)
#define	HPDMA_C5CR_PRIO_B_0X2					(0x2u<<22)
#define	HPDMA_C5CR_PRIO_B_0X3					(0x3u<<22)
#define	HPDMA_C5CR_LAP_B_0X0					(0x0u<<17)
#define	HPDMA_C5CR_LAP_B_0X1					(0x1u<<17)
#define	HPDMA_C5CR_LSM_B_0X0					(0x0u<<16)
#define	HPDMA_C5CR_LSM_B_0X1					(0x1u<<16)
#define	HPDMA_C5CR_TOIE_B_0X0					(0x0u<<14)
#define	HPDMA_C5CR_TOIE_B_0X1					(0x1u<<14)
#define	HPDMA_C5CR_SUSPIE_B_0X0					(0x0u<<13)
#define	HPDMA_C5CR_SUSPIE_B_0X1					(0x1u<<13)
#define	HPDMA_C5CR_USEIE_B_0X0					(0x0u<<12)
#define	HPDMA_C5CR_USEIE_B_0X1					(0x1u<<12)
#define	HPDMA_C5CR_ULEIE_B_0X0					(0x0u<<11)
#define	HPDMA_C5CR_ULEIE_B_0X1					(0x1u<<11)
#define	HPDMA_C5CR_DTEIE_B_0X0					(0x0u<<10)
#define	HPDMA_C5CR_DTEIE_B_0X1					(0x1u<<10)
#define	HPDMA_C5CR_HTIE_B_0X0					(0x0u<<9)
#define	HPDMA_C5CR_HTIE_B_0X1					(0x1u<<9)
#define	HPDMA_C5CR_TCIE_B_0X0					(0x0u<<8)
#define	HPDMA_C5CR_TCIE_B_0X1					(0x1u<<8)
#define	HPDMA_C5CR_SUSP_B_0X0					(0x0u<<2)
#define	HPDMA_C5CR_SUSP_B_0X1					(0x1u<<2)
#define	HPDMA_C5CR_RESET_B_0X0					(0x0u<<1)
#define	HPDMA_C5CR_RESET_B_0X1					(0x1u<<1)
#define	HPDMA_C5CR_EN_B_0X0						(0x0u<<0)
#define	HPDMA_C5CR_EN_B_0X1						(0x1u<<0)

