hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_hpdma.h
#define	HPDMA_C8SEMCR_SEM_CCID					(0x7u<<4)
#define	HPDMA_C8SEMCR_SEM_CCID_0				(0x1u<<4)
#define	HPDMA_C8SEMCR_SEM_MUTEX					(0x1u<<0)

#define	HPDMA_C8SEMCR_SEM_CCID_B_0X0			(0x0u<<4)
#define	HPDMA_C8SEMCR_SEM_CCID_B_0X1			(0x1u<<4)
#define	HPDMA_C8SEMCR_SEM_CCID_B_0X2			(0x2u<<4)
#define	HPDMA_C8SEMCR_SEM_CCID_B_0X3			(0x3u<<4)
#define	HPDMA_C8SEMCR_SEM_CCID_B_0X4			(0x4u<<4)
#define	HPDMA_C8SEMCR_SEM_CCID_B_0X5			(0x5u<<4)
#define	HPDMA_C8SEMCR_SEM_CCID_B_0X6			(0x6u<<4)
#define	HPDMA_C8SEMCR_SEM_MUTEX_B_0X0_WRITE		(0x0u<<0)
#define	HPDMA_C8SEMCR_SEM_MUTEX_B_0X1_WRITE		(0x1u<<0)

// C8FCR Configuration

#define	HPDMA_C8FCR_TOF							(0x1u<<14)
#define	HPDMA_C8FCR_SUSPF						(0x1u<<13)
#define	HPDMA_C8FCR_USEF						(0x1u<<12)
#define	HPDMA_C8FCR_ULEF						(0x1u<<11)
#define	HPDMA_C8FCR_DTEF						(0x1u<<10)
#define	HPDMA_C8FCR_HTF							(0x1u<<9)
#define	HPDMA_C8FCR_TCF							(0x1u<<8)

#define	HPDMA_C8FCR_TOF_B_0X0					(0x0u<<14)
#define	HPDMA_C8FCR_TOF_B_0X1					(0x1u<<14)
#define	HPDMA_C8FCR_SUSPF_B_0X0					(0x0u<<13)
#define	HPDMA_C8FCR_SUSPF_B_0X1					(0x1u<<13)
#define	HPDMA_C8FCR_USEF_B_0X0					(0x0u<<12)
#define	HPDMA_C8FCR_USEF_B_0X1					(0x1u<<12)
#define	HPDMA_C8FCR_ULEF_B_0X0					(0x0u<<11)
#define	HPDMA_C8FCR_ULEF_B_0X1					(0x1u<<11)
#define	HPDMA_C8FCR_DTEF_B_0X0					(0x0u<<10)
#define	HPDMA_C8FCR_DTEF_B_0X1					(0x1u<<10)
#define	HPDMA_C8FCR_HTF_B_0X0					(0x0u<<9)
#define	HPDMA_C8FCR_HTF_B_0X1					(0x1u<<9)
#define	HPDMA_C8FCR_TCF_B_0X0					(0x0u<<8)
#define	HPDMA_C8FCR_TCF_B_0X1					(0x1u<<8)

// C8SR Configuration

#define	HPDMA_C8SR_FIFOL						(0x1FFu<<16)
#define	HPDMA_C8SR_FIFOL_0						(0x1u<<16)
#define	HPDMA_C8SR_TOF							(0x1u<<14)
#define	HPDMA_C8SR_SUSPF						(0x1u<<13)
#define	HPDMA_C8SR_USEF							(0x1u<<12)
#define	HPDMA_C8SR_ULEF							(0x1u<<11)
#define	HPDMA_C8SR_DTEF							(0x1u<<10)
#define	HPDMA_C8SR_HTF							(0x1u<<9)
#define	HPDMA_C8SR_TCF							(0x1u<<8)
#define	HPDMA_C8SR_IDLEF						(0x1u<<0)

#define	HPDMA_C8SR_TOF_B_0X0					(0x0u<<14)
#define	HPDMA_C8SR_TOF_B_0X1					(0x1u<<14)
#define	HPDMA_C8SR_SUSPF_B_0X0					(0x0u<<13)
#define	HPDMA_C8SR_SUSPF_B_0X1					(0x1u<<13)
#define	HPDMA_C8SR_USEF_B_0X0					(0x0u<<12)
#define	HPDMA_C8SR_USEF_B_0X1					(0x1u<<12)
#define	HPDMA_C8SR_ULEF_B_0X0					(0x0u<<11)
#define	HPDMA_C8SR_ULEF_B_0X1					(0x1u<<11)
#define	HPDMA_C8SR_DTEF_B_0X0					(0x0u<<10)
#define	HPDMA_C8SR_DTEF_B_0X1					(0x1u<<10)
#define	HPDMA_C8SR_HTF_B_0X0					(0x0u<<9)
#define	HPDMA_C8SR_HTF_B_0X1					(0x1u<<9)
#define	HPDMA_C8SR_TCF_B_0X0					(0x0u<<8)
#define	HPDMA_C8SR_TCF_B_0X1					(0x1u<<8)
#define	HPDMA_C8SR_IDLEF_B_0X0					(0x0u<<0)
#define	HPDMA_C8SR_IDLEF_B_0X1					(0x1u<<0)

// C8CR Configuration

#define	HPDMA_C8CR_PRIO							(0x3u<<22)
#define	HPDMA_C8CR_PRIO_0						(0x1u<<22)
#define	HPDMA_C8CR_LAP							(0x1u<<17)
#define	HPDMA_C8CR_LSM							(0x1u<<16)
#define	HPDMA_C8CR_TOIE							(0x1u<<14)
#define	HPDMA_C8CR_SUSPIE						(0x1u<<13)
#define	HPDMA_C8CR_USEIE						(0x1u<<12)
#define	HPDMA_C8CR_ULEIE						(0x1u<<11)
#define	HPDMA_C8CR_DTEIE						(0x1u<<10)
#define	HPDMA_C8CR_HTIE							(0x1u<<9)
#define	HPDMA_C8CR_TCIE							(0x1u<<8)
#define	HPDMA_C8CR_SUSP							(0x1u<<2)
#define	HPDMA_C8CR_RESET						(0x1u<<1)
#define	HPDMA_C8CR_EN							(0x1u<<0)

#define	HPDMA_C8CR_PRIO_B_0X0					(0x0u<<22)
#define	HPDMA_C8CR_PRIO_B_0X1					(0x1u<<22)
#define	HPDMA_C8CR_PRIO_B_0X2					(0x2u<<22)
#define	HPDMA_C8CR_PRIO_B_0X3					(0x3u<<22)
#define	HPDMA_C8CR_LAP_B_0X0					(0x0u<<17)
#define	HPDMA_C8CR_LAP_B_0X1					(0x1u<<17)
#define	HPDMA_C8CR_LSM_B_0X0					(0x0u<<16)
#define	HPDMA_C8CR_LSM_B_0X1					(0x1u<<16)
#define	HPDMA_C8CR_TOIE_B_0X0					(0x0u<<14)
#define	HPDMA_C8CR_TOIE_B_0X1					(0x1u<<14)
#define	HPDMA_C8CR_SUSPIE_B_0X0					(0x0u<<13)
#define	HPDMA_C8CR_SUSPIE_B_0X1					(0x1u<<13)
#define	HPDMA_C8CR_USEIE_B_0X0					(0x0u<<12)
#define	HPDMA_C8CR_USEIE_B_0X1					(0x1u<<12)
#define	HPDMA_C8CR_ULEIE_B_0X0					(0x0u<<11)
#define	HPDMA_C8CR_ULEIE_B_0X1					(0x1u<<11)
#define	HPDMA_C8CR_DTEIE_B_0X0					(0x0u<<10)
#define	HPDMA_C8CR_DTEIE_B_0X1					(0x1u<<10)
#define	HPDMA_C8CR_HTIE_B_0X0					(0x0u<<9)
#define	HPDMA_C8CR_HTIE_B_0X1					(0x1u<<9)
#define	HPDMA_C8CR_TCIE_B_0X0					(0x0u<<8)
#define	HPDMA_C8CR_TCIE_B_0X1					(0x1u<<8)
#define	HPDMA_C8CR_SUSP_B_0X0					(0x0u<<2)
#define	HPDMA_C8CR_SUSP_B_0X1					(0x1u<<2)
#define	HPDMA_C8CR_RESET_B_0X0					(0x0u<<1)
#define	HPDMA_C8CR_RESET_B_0X1					(0x1u<<1)
#define	HPDMA_C8CR_EN_B_0X0						(0x0u<<0)
#define	HPDMA_C8CR_EN_B_0X1						(0x1u<<0)

// C8TR1 Configuration

#define	HPDMA_C8TR1_DSEC						(0x1u<<31)
#define	HPDMA_C8TR1_DAP							(0x1u<<30)
#define	HPDMA_C8TR1_DWX							(0x1u<<28)
#define	HPDMA_C8TR1_DHX							(0x1u<<27)
#define	HPDMA_C8TR1_DBX							(0x1u<<26)
#define	HPDMA_C8TR1_DBL_1						(0x3Fu<<20)
#define	HPDMA_C8TR1_DBL_1_0						(0x1u<<20)
#define	HPDMA_C8TR1_DINC						(0x1u<<19)
#define	HPDMA_C8TR1_DDW_LOG2					(0x3u<<16)
#define	HPDMA_C8TR1_DDW_LOG2_0					(0x1u<<16)
#define	HPDMA_C8TR1_SSEC						(0x1u<<15)
#define	HPDMA_C8TR1_SAP							(0x1u<<14)
#define	HPDMA_C8TR1_SBX							(0x1u<<13)
#define	HPDMA_C8TR1_PAM							(0x3u<<11)
#define	HPDMA_C8TR1_PAM_0						(0x1u<<11)
#define	HPDMA_C8TR1_SBL_1						(0x3Fu<<4)
#define	HPDMA_C8TR1_SBL_1_0						(0x1u<<4)
#define	HPDMA_C8TR1_SINC						(0x1u<<3)
#define	HPDMA_C8TR1_SDW_LOG2					(0x3u<<0)
#define	HPDMA_C8TR1_SDW_LOG2_0					(0x1u<<0)

#define	HPDMA_C8TR1_DSEC_B_0X0					(0x0u<<31)
#define	HPDMA_C8TR1_DSEC_B_0X1					(0x1u<<31)
#define	HPDMA_C8TR1_DAP_B_0X0					(0x0u<<30)
#define	HPDMA_C8TR1_DAP_B_0X1					(0x1u<<30)
#define	HPDMA_C8TR1_DWX_B_0X0					(0x0u<<28)
#define	HPDMA_C8TR1_DWX_B_0X1					(0x1u<<28)
#define	HPDMA_C8TR1_DHX_B_0X0					(0x0u<<27)
#define	HPDMA_C8TR1_DHX_B_0X1					(0x1u<<27)
#define	HPDMA_C8TR1_DBX_B_0X0					(0x0u<<26)
#define	HPDMA_C8TR1_DBX_B_0X1					(0x1u<<26)
#define	HPDMA_C8TR1_DINC_B_0X0					(0x0u<<19)
#define	HPDMA_C8TR1_DINC_B_0X1					(0x1u<<19)
#define	HPDMA_C8TR1_DDW_LOG2_B_0X0				(0x0u<<16)
#define	HPDMA_C8TR1_DDW_LOG2_B_0X1				(0x1u<<16)
#define	HPDMA_C8TR1_DDW_LOG2_B_0X2				(0x2u<<16)
#define	HPDMA_C8TR1_DDW_LOG2_B_0X3				(0x3u<<16)
#define	HPDMA_C8TR1_SSEC_B_0X0					(0x0u<<15)
#define	HPDMA_C8TR1_SSEC_B_0X1					(0x1u<<15)
#define	HPDMA_C8TR1_SAP_B_0X0					(0x0u<<14)
#define	HPDMA_C8TR1_SAP_B_0X1					(0x1u<<14)
#define	HPDMA_C8TR1_SBX_B_0X0					(0x0u<<13)
#define	HPDMA_C8TR1_SBX_B_0X1					(0x1u<<13)
#define	HPDMA_C8TR1_PAM_B_0X0_PAM_1				(0x0u<<11)
#define	HPDMA_C8TR1_PAM_B_0X1_PAM_1				(0x1u<<11)
#define	HPDMA_C8TR1_PAM_B_0X2_PAM_1				(0x2u<<11)
#define	HPDMA_C8TR1_PAM_B_0X3_PAM_1				(0x3u<<11)
#define	HPDMA_C8TR1_SINC_B_0X0					(0x0u<<3)
#define	HPDMA_C8TR1_SINC_B_0X1					(0x1u<<3)
#define	HPDMA_C8TR1_SDW_LOG2_B_0X0				(0x0u<<0)
#define	HPDMA_C8TR1_SDW_LOG2_B_0X1				(0x1u<<0)
#define	HPDMA_C8TR1_SDW_LOG2_B_0X2				(0x2u<<0)
#define	HPDMA_C8TR1_SDW_LOG2_B_0X3				(0x3u<<0)

// C8TR2 Configuration

#define	HPDMA_C8TR2_TCEM						(0x3u<<30)
#define	HPDMA_C8TR2_TCEM_0						(0x1u<<30)
#define	HPDMA_C8TR2_TRIGPOL						(0x3u<<24)
#define	HPDMA_C8TR2_TRIGPOL_0					(0x1u<<24)
#define	HPDMA_C8TR2_TRIGSEL						(0x7Fu<<16)
#define	HPDMA_C8TR2_TRIGSEL_0					(0x1u<<16)
#define	HPDMA_C8TR2_TRIGM						(0x3u<<14)
#define	HPDMA_C8TR2_TRIGM_0						(0x1u<<14)
#define	HPDMA_C8TR2_PFREQ						(0x1u<<12)
#define	HPDMA_C8TR2_BREQ						(0x1u<<11)
#define	HPDMA_C8TR2_DREQ						(0x1u<<10)
#define	HPDMA_C8TR2_SWREQ						(0x1u<<9)
#define	HPDMA_C8TR2_REQSEL						(0xFFu<<0)
#define	HPDMA_C8TR2_REQSEL_0					(0x1u<<0)

#define	HPDMA_C8TR2_TCEM_B_0X0					(0x0u<<30)
#define	HPDMA_C8TR2_TCEM_B_0X1					(0x1u<<30)
#define	HPDMA_C8TR2_TCEM_B_0X2					(0x2u<<30)
#define	HPDMA_C8TR2_TCEM_B_0X3					(0x3u<<30)
#define	HPDMA_C8TR2_TRIGPOL_B_0X0				(0x0u<<24)
#define	HPDMA_C8TR2_TRIGPOL_B_0X1				(0x1u<<24)
#define	HPDMA_C8TR2_TRIGPOL_B_0X2				(0x2u<<24)
#define	HPDMA_C8TR2_TRIGPOL_B_0X3				(0x3u<<24)
#define	HPDMA_C8TR2_TRIGM_B_0X0					(0x0u<<14)
#define	HPDMA_C8TR2_TRIGM_B_0X1					(0x1u<<14)
#define	HPDMA_C8TR2_TRIGM_B_0X2					(0x2u<<14)
#define	HPDMA_C8TR2_TRIGM_B_0X3					(0x3u<<14)
#define	HPDMA_C8TR2_PFREQ_B_0X0					(0x0u<<12)
#define	HPDMA_C8TR2_PFREQ_B_0X1					(0x1u<<12)
#define	HPDMA_C8TR2_BREQ_B_0X0					(0x0u<<11)
#define	HPDMA_C8TR2_BREQ_B_0X1					(0x1u<<11)
#define	HPDMA_C8TR2_DREQ_B_0X0					(0x0u<<10)
#define	HPDMA_C8TR2_DREQ_B_0X1					(0x1u<<10)
#define	HPDMA_C8TR2_SWREQ_B_0X0					(0x0u<<9)
#define	HPDMA_C8TR2_SWREQ_B_0X1					(0x1u<<9)

// C8BR1 Configuration

