hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_hpdma.h
#define	HPDMA_C8BR1_BNDT						(0xFFFFu<<0)
#define	HPDMA_C8BR1_BNDT_0						(0x1u<<0)

// C8SAR Configuration

#define	HPDMA_C8SAR_SA							(0xFFFFFFFFu<<0)
#define	HPDMA_C8SAR_SA_0						(0x1u<<0)

// C8DAR Configuration

#define	HPDMA_C8DAR_DA							(0xFFFFFFFFu<<0)
#define	HPDMA_C8DAR_DA_0						(0x1u<<0)

// C8LLR Configuration

#define	HPDMA_C8LLR_UT1							(0x1u<<31)
#define	HPDMA_C8LLR_UT2							(0x1u<<30)
#define	HPDMA_C8LLR_UB1							(0x1u<<29)
#define	HPDMA_C8LLR_USA							(0x1u<<28)
#define	HPDMA_C8LLR_UDA							(0x1u<<27)
#define	HPDMA_C8LLR_ULL							(0x1u<<16)
#define	HPDMA_C8LLR_LA							(0x3FFFu<<2)
#define	HPDMA_C8LLR_LA_0						(0x1u<<2)

#define	HPDMA_C8LLR_UT1_B_0X0					(0x0u<<31)
#define	HPDMA_C8LLR_UT1_B_0X1					(0x1u<<31)
#define	HPDMA_C8LLR_UT2_B_0X0					(0x0u<<30)
#define	HPDMA_C8LLR_UT2_B_0X1					(0x1u<<30)
#define	HPDMA_C8LLR_UB1_B_0X0					(0x0u<<29)
#define	HPDMA_C8LLR_UB1_B_0X1					(0x1u<<29)
#define	HPDMA_C8LLR_USA_B_0X0					(0x0u<<28)
#define	HPDMA_C8LLR_USA_B_0X1					(0x1u<<28)
#define	HPDMA_C8LLR_UDA_B_0X0					(0x0u<<27)
#define	HPDMA_C8LLR_UDA_B_0X1					(0x1u<<27)
#define	HPDMA_C8LLR_ULL_B_0X0					(0x0u<<16)
#define	HPDMA_C8LLR_ULL_B_0X1					(0x1u<<16)

// C9LBAR Configuration

#define	HPDMA_C9LBAR_LBA						(0xFFFFu<<16)
#define	HPDMA_C9LBAR_LBA_0						(0x1u<<16)

// C9CIDCFGR Configuration

#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID6			(0x1u<<22)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID5			(0x1u<<21)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID4			(0x1u<<20)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID3			(0x1u<<19)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID2			(0x1u<<18)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID1			(0x1u<<17)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID0			(0x1u<<16)
#define	HPDMA_C9CIDCFGR_SCID					(0x7u<<4)
#define	HPDMA_C9CIDCFGR_SCID_0					(0x1u<<4)
#define	HPDMA_C9CIDCFGR_SEM_EN					(0x1u<<1)
#define	HPDMA_C9CIDCFGR_CFEN					(0x1u<<0)

#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID6_B_0X0	(0x0u<<22)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID6_B_0X1	(0x1u<<22)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID5_B_0X0	(0x0u<<21)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID5_B_0X1	(0x1u<<21)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID4_B_0X0	(0x0u<<20)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID4_B_0X1	(0x1u<<20)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID3_B_0X0	(0x0u<<19)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID3_B_0X1	(0x1u<<19)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID2_B_0X0	(0x0u<<18)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID2_B_0X1	(0x1u<<18)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID1_B_0X0	(0x0u<<17)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID1_B_0X1	(0x1u<<17)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID0_B_0X0	(0x0u<<16)
#define	HPDMA_C9CIDCFGR_SEM_WLIST_CID0_B_0X1	(0x1u<<16)
#define	HPDMA_C9CIDCFGR_SCID_B_0X0				(0x0u<<4)
#define	HPDMA_C9CIDCFGR_SCID_B_0X1				(0x1u<<4)
#define	HPDMA_C9CIDCFGR_SCID_B_0X2				(0x2u<<4)
#define	HPDMA_C9CIDCFGR_SCID_B_0X3				(0x3u<<4)
#define	HPDMA_C9CIDCFGR_SCID_B_0X4				(0x4u<<4)
#define	HPDMA_C9CIDCFGR_SCID_B_0X5				(0x5u<<4)
#define	HPDMA_C9CIDCFGR_SCID_B_0X6				(0x6u<<4)
#define	HPDMA_C9CIDCFGR_SEM_EN_B_0X0			(0x0u<<1)
#define	HPDMA_C9CIDCFGR_SEM_EN_B_0X1			(0x1u<<1)
#define	HPDMA_C9CIDCFGR_CFEN_B_0X0				(0x0u<<0)
#define	HPDMA_C9CIDCFGR_CFEN_B_0X1				(0x1u<<0)

// C9SEMCR Configuration

#define	HPDMA_C9SEMCR_SEM_CCID					(0x7u<<4)
#define	HPDMA_C9SEMCR_SEM_CCID_0				(0x1u<<4)
#define	HPDMA_C9SEMCR_SEM_MUTEX					(0x1u<<0)

#define	HPDMA_C9SEMCR_SEM_CCID_B_0X0			(0x0u<<4)
#define	HPDMA_C9SEMCR_SEM_CCID_B_0X1			(0x1u<<4)
#define	HPDMA_C9SEMCR_SEM_CCID_B_0X2			(0x2u<<4)
#define	HPDMA_C9SEMCR_SEM_CCID_B_0X3			(0x3u<<4)
#define	HPDMA_C9SEMCR_SEM_CCID_B_0X4			(0x4u<<4)
#define	HPDMA_C9SEMCR_SEM_CCID_B_0X5			(0x5u<<4)
#define	HPDMA_C9SEMCR_SEM_CCID_B_0X6			(0x6u<<4)
#define	HPDMA_C9SEMCR_SEM_MUTEX_B_0X0_WRITE		(0x0u<<0)
#define	HPDMA_C9SEMCR_SEM_MUTEX_B_0X1_WRITE		(0x1u<<0)

// C9FCR Configuration

#define	HPDMA_C9FCR_TOF							(0x1u<<14)
#define	HPDMA_C9FCR_SUSPF						(0x1u<<13)
#define	HPDMA_C9FCR_USEF						(0x1u<<12)
#define	HPDMA_C9FCR_ULEF						(0x1u<<11)
#define	HPDMA_C9FCR_DTEF						(0x1u<<10)
#define	HPDMA_C9FCR_HTF							(0x1u<<9)
#define	HPDMA_C9FCR_TCF							(0x1u<<8)

#define	HPDMA_C9FCR_TOF_B_0X0					(0x0u<<14)
#define	HPDMA_C9FCR_TOF_B_0X1					(0x1u<<14)
#define	HPDMA_C9FCR_SUSPF_B_0X0					(0x0u<<13)
#define	HPDMA_C9FCR_SUSPF_B_0X1					(0x1u<<13)
#define	HPDMA_C9FCR_USEF_B_0X0					(0x0u<<12)
#define	HPDMA_C9FCR_USEF_B_0X1					(0x1u<<12)
#define	HPDMA_C9FCR_ULEF_B_0X0					(0x0u<<11)
#define	HPDMA_C9FCR_ULEF_B_0X1					(0x1u<<11)
#define	HPDMA_C9FCR_DTEF_B_0X0					(0x0u<<10)
#define	HPDMA_C9FCR_DTEF_B_0X1					(0x1u<<10)
#define	HPDMA_C9FCR_HTF_B_0X0					(0x0u<<9)
#define	HPDMA_C9FCR_HTF_B_0X1					(0x1u<<9)
#define	HPDMA_C9FCR_TCF_B_0X0					(0x0u<<8)
#define	HPDMA_C9FCR_TCF_B_0X1					(0x1u<<8)

// C9SR Configuration

#define	HPDMA_C9SR_FIFOL						(0x1FFu<<16)
#define	HPDMA_C9SR_FIFOL_0						(0x1u<<16)
#define	HPDMA_C9SR_TOF							(0x1u<<14)
#define	HPDMA_C9SR_SUSPF						(0x1u<<13)
#define	HPDMA_C9SR_USEF							(0x1u<<12)
#define	HPDMA_C9SR_ULEF							(0x1u<<11)
#define	HPDMA_C9SR_DTEF							(0x1u<<10)
#define	HPDMA_C9SR_HTF							(0x1u<<9)
#define	HPDMA_C9SR_TCF							(0x1u<<8)
#define	HPDMA_C9SR_IDLEF						(0x1u<<0)

#define	HPDMA_C9SR_TOF_B_0X0					(0x0u<<14)
#define	HPDMA_C9SR_TOF_B_0X1					(0x1u<<14)
#define	HPDMA_C9SR_SUSPF_B_0X0					(0x0u<<13)
#define	HPDMA_C9SR_SUSPF_B_0X1					(0x1u<<13)
#define	HPDMA_C9SR_USEF_B_0X0					(0x0u<<12)
#define	HPDMA_C9SR_USEF_B_0X1					(0x1u<<12)
#define	HPDMA_C9SR_ULEF_B_0X0					(0x0u<<11)
#define	HPDMA_C9SR_ULEF_B_0X1					(0x1u<<11)
#define	HPDMA_C9SR_DTEF_B_0X0					(0x0u<<10)
#define	HPDMA_C9SR_DTEF_B_0X1					(0x1u<<10)
#define	HPDMA_C9SR_HTF_B_0X0					(0x0u<<9)
#define	HPDMA_C9SR_HTF_B_0X1					(0x1u<<9)
#define	HPDMA_C9SR_TCF_B_0X0					(0x0u<<8)
#define	HPDMA_C9SR_TCF_B_0X1					(0x1u<<8)
#define	HPDMA_C9SR_IDLEF_B_0X0					(0x0u<<0)
#define	HPDMA_C9SR_IDLEF_B_0X1					(0x1u<<0)

// C9CR Configuration

#define	HPDMA_C9CR_PRIO							(0x3u<<22)
#define	HPDMA_C9CR_PRIO_0						(0x1u<<22)
#define	HPDMA_C9CR_LAP							(0x1u<<17)
#define	HPDMA_C9CR_LSM							(0x1u<<16)
#define	HPDMA_C9CR_TOIE							(0x1u<<14)
#define	HPDMA_C9CR_SUSPIE						(0x1u<<13)
#define	HPDMA_C9CR_USEIE						(0x1u<<12)
#define	HPDMA_C9CR_ULEIE						(0x1u<<11)
#define	HPDMA_C9CR_DTEIE						(0x1u<<10)
#define	HPDMA_C9CR_HTIE							(0x1u<<9)
#define	HPDMA_C9CR_TCIE							(0x1u<<8)
#define	HPDMA_C9CR_SUSP							(0x1u<<2)
#define	HPDMA_C9CR_RESET						(0x1u<<1)
#define	HPDMA_C9CR_EN							(0x1u<<0)

#define	HPDMA_C9CR_PRIO_B_0X0					(0x0u<<22)
#define	HPDMA_C9CR_PRIO_B_0X1					(0x1u<<22)
#define	HPDMA_C9CR_PRIO_B_0X2					(0x2u<<22)
#define	HPDMA_C9CR_PRIO_B_0X3					(0x3u<<22)
#define	HPDMA_C9CR_LAP_B_0X0					(0x0u<<17)
#define	HPDMA_C9CR_LAP_B_0X1					(0x1u<<17)
#define	HPDMA_C9CR_LSM_B_0X0					(0x0u<<16)
#define	HPDMA_C9CR_LSM_B_0X1					(0x1u<<16)
#define	HPDMA_C9CR_TOIE_B_0X0					(0x0u<<14)
#define	HPDMA_C9CR_TOIE_B_0X1					(0x1u<<14)
#define	HPDMA_C9CR_SUSPIE_B_0X0					(0x0u<<13)
#define	HPDMA_C9CR_SUSPIE_B_0X1					(0x1u<<13)
#define	HPDMA_C9CR_USEIE_B_0X0					(0x0u<<12)
#define	HPDMA_C9CR_USEIE_B_0X1					(0x1u<<12)
#define	HPDMA_C9CR_ULEIE_B_0X0					(0x0u<<11)
#define	HPDMA_C9CR_ULEIE_B_0X1					(0x1u<<11)
#define	HPDMA_C9CR_DTEIE_B_0X0					(0x0u<<10)
#define	HPDMA_C9CR_DTEIE_B_0X1					(0x1u<<10)
#define	HPDMA_C9CR_HTIE_B_0X0					(0x0u<<9)
#define	HPDMA_C9CR_HTIE_B_0X1					(0x1u<<9)
#define	HPDMA_C9CR_TCIE_B_0X0					(0x0u<<8)
#define	HPDMA_C9CR_TCIE_B_0X1					(0x1u<<8)
#define	HPDMA_C9CR_SUSP_B_0X0					(0x0u<<2)
#define	HPDMA_C9CR_SUSP_B_0X1					(0x1u<<2)
#define	HPDMA_C9CR_RESET_B_0X0					(0x0u<<1)
#define	HPDMA_C9CR_RESET_B_0X1					(0x1u<<1)
#define	HPDMA_C9CR_EN_B_0X0						(0x0u<<0)
#define	HPDMA_C9CR_EN_B_0X1						(0x1u<<0)

// C9TR1 Configuration

#define	HPDMA_C9TR1_DSEC						(0x1u<<31)
#define	HPDMA_C9TR1_DAP							(0x1u<<30)
#define	HPDMA_C9TR1_DWX							(0x1u<<28)
#define	HPDMA_C9TR1_DHX							(0x1u<<27)
#define	HPDMA_C9TR1_DBX							(0x1u<<26)
#define	HPDMA_C9TR1_DBL_1						(0x3Fu<<20)
#define	HPDMA_C9TR1_DBL_1_0						(0x1u<<20)
#define	HPDMA_C9TR1_DINC						(0x1u<<19)
#define	HPDMA_C9TR1_DDW_LOG2					(0x3u<<16)
#define	HPDMA_C9TR1_DDW_LOG2_0					(0x1u<<16)
#define	HPDMA_C9TR1_SSEC						(0x1u<<15)
#define	HPDMA_C9TR1_SAP							(0x1u<<14)
#define	HPDMA_C9TR1_SBX							(0x1u<<13)
#define	HPDMA_C9TR1_PAM							(0x3u<<11)
#define	HPDMA_C9TR1_PAM_0						(0x1u<<11)
#define	HPDMA_C9TR1_SBL_1						(0x3Fu<<4)
#define	HPDMA_C9TR1_SBL_1_0						(0x1u<<4)
#define	HPDMA_C9TR1_SINC						(0x1u<<3)
#define	HPDMA_C9TR1_SDW_LOG2					(0x3u<<0)
#define	HPDMA_C9TR1_SDW_LOG2_0					(0x1u<<0)

