hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_hpdma.h
#define	HPDMA_C13TR2_TCEM						(0x3u<<30)
#define	HPDMA_C13TR2_TCEM_0						(0x1u<<30)
#define	HPDMA_C13TR2_TRIGPOL					(0x3u<<24)
#define	HPDMA_C13TR2_TRIGPOL_0					(0x1u<<24)
#define	HPDMA_C13TR2_TRIGSEL					(0x7Fu<<16)
#define	HPDMA_C13TR2_TRIGSEL_0					(0x1u<<16)
#define	HPDMA_C13TR2_TRIGM						(0x3u<<14)
#define	HPDMA_C13TR2_TRIGM_0					(0x1u<<14)
#define	HPDMA_C13TR2_PFREQ						(0x1u<<12)
#define	HPDMA_C13TR2_BREQ						(0x1u<<11)
#define	HPDMA_C13TR2_DREQ						(0x1u<<10)
#define	HPDMA_C13TR2_SWREQ						(0x1u<<9)
#define	HPDMA_C13TR2_REQSEL						(0xFFu<<0)
#define	HPDMA_C13TR2_REQSEL_0					(0x1u<<0)

#define	HPDMA_C13TR2_TCEM_B_0X0					(0x0u<<30)
#define	HPDMA_C13TR2_TCEM_B_0X1					(0x1u<<30)
#define	HPDMA_C13TR2_TCEM_B_0X2					(0x2u<<30)
#define	HPDMA_C13TR2_TCEM_B_0X3					(0x3u<<30)
#define	HPDMA_C13TR2_TRIGPOL_B_0X0				(0x0u<<24)
#define	HPDMA_C13TR2_TRIGPOL_B_0X1				(0x1u<<24)
#define	HPDMA_C13TR2_TRIGPOL_B_0X2				(0x2u<<24)
#define	HPDMA_C13TR2_TRIGPOL_B_0X3				(0x3u<<24)
#define	HPDMA_C13TR2_TRIGM_B_0X0				(0x0u<<14)
#define	HPDMA_C13TR2_TRIGM_B_0X1				(0x1u<<14)
#define	HPDMA_C13TR2_TRIGM_B_0X2				(0x2u<<14)
#define	HPDMA_C13TR2_TRIGM_B_0X3				(0x3u<<14)
#define	HPDMA_C13TR2_PFREQ_B_0X0				(0x0u<<12)
#define	HPDMA_C13TR2_PFREQ_B_0X1				(0x1u<<12)
#define	HPDMA_C13TR2_BREQ_B_0X0					(0x0u<<11)
#define	HPDMA_C13TR2_BREQ_B_0X1					(0x1u<<11)
#define	HPDMA_C13TR2_DREQ_B_0X0					(0x0u<<10)
#define	HPDMA_C13TR2_DREQ_B_0X1					(0x1u<<10)
#define	HPDMA_C13TR2_SWREQ_B_0X0				(0x0u<<9)
#define	HPDMA_C13TR2_SWREQ_B_0X1				(0x1u<<9)

// C13BR1 Configuration

#define	HPDMA_C13BR1_BRDDEC						(0x1u<<31)
#define	HPDMA_C13BR1_BRSDEC						(0x1u<<30)
#define	HPDMA_C13BR1_DDEC						(0x1u<<29)
#define	HPDMA_C13BR1_SDEC						(0x1u<<28)
#define	HPDMA_C13BR1_BRC						(0x7FFu<<16)
#define	HPDMA_C13BR1_BRC_0						(0x1u<<16)
#define	HPDMA_C13BR1_BNDT						(0xFFFFu<<0)
#define	HPDMA_C13BR1_BNDT_0						(0x1u<<0)

#define	HPDMA_C13BR1_BRDDEC_B_0X0				(0x0u<<31)
#define	HPDMA_C13BR1_BRDDEC_B_0X1				(0x1u<<31)
#define	HPDMA_C13BR1_BRSDEC_B_0X0				(0x0u<<30)
#define	HPDMA_C13BR1_BRSDEC_B_0X1				(0x1u<<30)
#define	HPDMA_C13BR1_DDEC_B_0X0					(0x0u<<29)
#define	HPDMA_C13BR1_DDEC_B_0X1					(0x1u<<29)
#define	HPDMA_C13BR1_SDEC_B_0X0					(0x0u<<28)
#define	HPDMA_C13BR1_SDEC_B_0X1					(0x1u<<28)

// C13SAR Configuration

#define	HPDMA_C13SAR_SA							(0xFFFFFFFFu<<0)
#define	HPDMA_C13SAR_SA_0						(0x1u<<0)

// C13DAR Configuration

#define	HPDMA_C13DAR_DA							(0xFFFFFFFFu<<0)
#define	HPDMA_C13DAR_DA_0						(0x1u<<0)

// C13TR3 Configuration

#define	HPDMA_C13TR3_DAO						(0x1FFFu<<16)
#define	HPDMA_C13TR3_DAO_0						(0x1u<<16)
#define	HPDMA_C13TR3_SAO						(0x1FFFu<<0)
#define	HPDMA_C13TR3_SAO_0						(0x1u<<0)

// C13BR2 Configuration

#define	HPDMA_C13BR2_BRDAO						(0xFFFFu<<16)
#define	HPDMA_C13BR2_BRDAO_0					(0x1u<<16)
#define	HPDMA_C13BR2_BRSAO						(0xFFFFu<<0)
#define	HPDMA_C13BR2_BRSAO_0					(0x1u<<0)

// C13LLR Configuration

#define	HPDMA_C13LLR_UT1						(0x1u<<31)
#define	HPDMA_C13LLR_UT2						(0x1u<<30)
#define	HPDMA_C13LLR_UB1						(0x1u<<29)
#define	HPDMA_C13LLR_USA						(0x1u<<28)
#define	HPDMA_C13LLR_UDA						(0x1u<<27)
#define	HPDMA_C13LLR_UT3						(0x1u<<26)
#define	HPDMA_C13LLR_UB2						(0x1u<<25)
#define	HPDMA_C13LLR_ULL						(0x1u<<16)
#define	HPDMA_C13LLR_LA							(0x3FFFu<<2)
#define	HPDMA_C13LLR_LA_0						(0x1u<<2)

#define	HPDMA_C13LLR_UT1_B_0X0					(0x0u<<31)
#define	HPDMA_C13LLR_UT1_B_0X1					(0x1u<<31)
#define	HPDMA_C13LLR_UT2_B_0X0					(0x0u<<30)
#define	HPDMA_C13LLR_UT2_B_0X1					(0x1u<<30)
#define	HPDMA_C13LLR_UB1_B_0X0					(0x0u<<29)
#define	HPDMA_C13LLR_UB1_B_0X1					(0x1u<<29)
#define	HPDMA_C13LLR_USA_B_0X0					(0x0u<<28)
#define	HPDMA_C13LLR_USA_B_0X1					(0x1u<<28)
#define	HPDMA_C13LLR_UDA_B_0X0					(0x0u<<27)
#define	HPDMA_C13LLR_UDA_B_0X1					(0x1u<<27)
#define	HPDMA_C13LLR_UT3_B_0X0					(0x0u<<26)
#define	HPDMA_C13LLR_UT3_B_0X1					(0x1u<<26)
#define	HPDMA_C13LLR_UB2_B_0X0					(0x0u<<25)
#define	HPDMA_C13LLR_UB2_B_0X1					(0x1u<<25)
#define	HPDMA_C13LLR_ULL_B_0X0					(0x0u<<16)
#define	HPDMA_C13LLR_ULL_B_0X1					(0x1u<<16)

// C14LBAR Configuration

#define	HPDMA_C14LBAR_LBA						(0xFFFFu<<16)
#define	HPDMA_C14LBAR_LBA_0						(0x1u<<16)

// C14CIDCFGR Configuration

#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID6			(0x1u<<22)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID5			(0x1u<<21)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID4			(0x1u<<20)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID3			(0x1u<<19)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID2			(0x1u<<18)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID1			(0x1u<<17)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID0			(0x1u<<16)
#define	HPDMA_C14CIDCFGR_SCID					(0x7u<<4)
#define	HPDMA_C14CIDCFGR_SCID_0					(0x1u<<4)
#define	HPDMA_C14CIDCFGR_SEM_EN					(0x1u<<1)
#define	HPDMA_C14CIDCFGR_CFEN					(0x1u<<0)

#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID6_B_0X0	(0x0u<<22)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID6_B_0X1	(0x1u<<22)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID5_B_0X0	(0x0u<<21)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID5_B_0X1	(0x1u<<21)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID4_B_0X0	(0x0u<<20)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID4_B_0X1	(0x1u<<20)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID3_B_0X0	(0x0u<<19)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID3_B_0X1	(0x1u<<19)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID2_B_0X0	(0x0u<<18)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID2_B_0X1	(0x1u<<18)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID1_B_0X0	(0x0u<<17)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID1_B_0X1	(0x1u<<17)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID0_B_0X0	(0x0u<<16)
#define	HPDMA_C14CIDCFGR_SEM_WLIST_CID0_B_0X1	(0x1u<<16)
#define	HPDMA_C14CIDCFGR_SCID_B_0X0				(0x0u<<4)
#define	HPDMA_C14CIDCFGR_SCID_B_0X1				(0x1u<<4)
#define	HPDMA_C14CIDCFGR_SCID_B_0X2				(0x2u<<4)
#define	HPDMA_C14CIDCFGR_SCID_B_0X3				(0x3u<<4)
#define	HPDMA_C14CIDCFGR_SCID_B_0X4				(0x4u<<4)
#define	HPDMA_C14CIDCFGR_SCID_B_0X5				(0x5u<<4)
#define	HPDMA_C14CIDCFGR_SCID_B_0X6				(0x6u<<4)
#define	HPDMA_C14CIDCFGR_SEM_EN_B_0X0			(0x0u<<1)
#define	HPDMA_C14CIDCFGR_SEM_EN_B_0X1			(0x1u<<1)
#define	HPDMA_C14CIDCFGR_CFEN_B_0X0				(0x0u<<0)
#define	HPDMA_C14CIDCFGR_CFEN_B_0X1				(0x1u<<0)

